/**
 * Created by 365969 on 2017/3/24.
 */


/**
 * TODO:
 *  1.轮播图高度问题
 *  2.异步请求更改dom
 *  3.请求失败处理,
 *  4.数量组件弹出键盘 bug
 *  5.测试口味，规格  空数据时会不会报错
 *  6.呼叫系统
 *  7.结账吧台确认
 *  8.口味单选，特殊需求多选
 *  9.口味，大小份默认分先写死
 *  10.确认之前修改以点的（左滑）
 * */

/**
 * TODO:进度
 *  2017-03-29：选择口味、大小份，数量时金额变化
 *  2017-03-31: 选择口味、大小份，数量 的默认值
 *  2017-03-31: 修改口味弹出框的小计，切换时重新计算小计，数量默认值，确定后的修改，action，reducer中之前的修改
 *  2017-04-01: 购物车修改，删除 基本功能完成，待开发：确认后、websocket 实时菜单信息
 * */




/**
 * backStage TODO:
 *  2017/04/21:添加菜单重新改版，添加单品同时设置所有内容，现版本过于繁琐。
 *
 *
 * **/